using System;
/*Розробити абстрактний клас «Геометрична Фігура» з методами «Площа Фігури»
 * і «Периметр Фігури».
Розробити похідні класи: Трикутник, Квадрат, Ромб, Прямокутник, Паралелограм,
Трапеція, Коло, Еліпс.
Реалізувати конструктори, які однозначно визначають об'єкти даних класів.
Реалізувати клас «Складена Фігура», який може складатися з будь-якої кількості 
«Геометричних Фігур».Для даного класу визначити метод знаходження
площі фігури.*/
/*
Triangle, Square, Rhombus, Rectangle, Parallelogram,Trapezoid, Circle, Ellipse*/
namespace _18._09._2019
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
