using System;
/*Завдання:
Напишіть клас RangeOfArray, який дозволяє працювати з масивом такого типу, в якому індексний діапазон встановлюється користувачем. Наприклад, в діапазоні від 6 до 10, або від -9 до 15.
Діапазон встановлюєтья в параметризованому конструкторі, який приймає верхній та нижній індекс, або ж тільки верхній індекс, а нижній буде починатися з нуля.
Також передбачити конструктор по замовчуванню, який встановить діапазон [0...10).
Підказка: У класі можна оголосити дві змінних, які будуть містити верхній і нижній індекс допустимого діапазону.
*/
namespace _17._09._2019
{
    class Program
    {
        static void Main(string[] args)
        {
            const short down = -5;
            const short up = 5;
            RangeOfArray array =new RangeOfArray(up, down);
            for (int i = down; i <up; i++)
            {
            Console.WriteLine(array[i]);

            }
            array[-5] = 100;
            Console.WriteLine();
            for (int i = down; i < up; i++)
            {
                Console.WriteLine(array[i]);

            }
        }
    }
}
